stress/load.yml
# Artillery HTTP load test for Drelix
# Run: npm run test:load (localhost)
# Prod: npm run test:load:prod
config:
  target: "http://localhost:3000"
  environments:
    prod:
      target: "https://drelix.org"
  phases:
    - duration: 10
      arrivalRate: 2
      name: "Ramp up"
    - duration: 20
      arrivalRate: 5
      name: "Sustained load"
    - duration: 10
      arrivalRate: 10
      name: "Stress"
  ensure:
    maxErrorRate: 0.05
    p95: 3000

scenarios:
  - name: "Public pages"
    flow:
      - get:
          url: "/"
      - think: 0.5
      - get:
          url: "/products"
      - think: 0.5
      - get:
          url: "/admin/login"